# Pandas
    - Library for Data Analysis and Manipulation.
    Data Analysis--> To Analyze the dataset and to get important information about the data.
    Data MAnipulation--> If we wish to add a new attribute in a dataset or if we wish to remove attributes from
    dataSet we can do that using Pandas Library. We can even remove duplicate entries from the dataSet using 
    Pandas.

#  Why Pandas?
    - It provides ability to work with Tabular Data.
    - Tabular Data: Data which is organized in the form of rows and columns. Eg:- SQL, Excel Data.

In [1]:
# Pandas Installation
!pip install pandas

Requirement already satisfied: pandas in /home/shashwat/anaconda3/lib/python3.8/site-packages (1.2.4)
Requirement already satisfied: python-dateutil>=2.7.3 in /home/shashwat/anaconda3/lib/python3.8/site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.3 in /home/shashwat/anaconda3/lib/python3.8/site-packages (from pandas) (2021.1)
Requirement already satisfied: numpy>=1.16.5 in /home/shashwat/anaconda3/lib/python3.8/site-packages (from pandas) (1.20.1)
Requirement already satisfied: six>=1.5 in /home/shashwat/anaconda3/lib/python3.8/site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [2]:
import pandas as pd

# Series
    - It is a One-Dimensional Labelled array that can hold/store data.

In [3]:
bookTitle= ['C++','Java','Python','JavaSript']
bookTitle= pd.Series(bookTitle)
bookTitle

0          C++
1         Java
2       Python
3    JavaSript
dtype: object

In [4]:
bookTitle[1]

'Java'

In [5]:
# Now if we wish to pass Custom Indexies.
bookTitle.index=['a','b','c','d']
bookTitle

a          C++
b         Java
c       Python
d    JavaSript
dtype: object

In [6]:
bookTitle['c']

'Python'

# DataFrames
    - 2D labelled array with index and Columns.
    - Mutiple Series Combined Together to form a DataFrame.
    - Most Widely used DataStructure in Pandas.

In [7]:
import numpy as np
arr=np.random.randint(5,50,(6,4))
arr

array([[30, 24, 25, 36],
       [ 9, 49, 30, 28],
       [43, 20, 46, 44],
       [29, 36, 20, 32],
       [36, 31, 10, 27],
       [21, 30, 10, 38]])

In [8]:
df=pd.DataFrame(data=arr)
df

    0   1   2   3
0  30  24  25  36
1   9  49  30  28
2  43  20  46  44
3  29  36  20  32
4  36  31  10  27
5  21  30  10  38

In [9]:
df[2]

0    25
1    30
2    46
3    20
4    10
5    10
Name: 2, dtype: int64

In [11]:
print(type(df))
print(type(df[2])) # By this we can conclude that a DataFrame consists of many Series.

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [17]:
df.columns=['A','B','C','D'] # Change the Column Name of the DataFrame.
df

    A   B   C   D
0  30  24  25  36
1   9  49  30  28
2  43  20  46  44
3  29  36  20  32
4  36  31  10  27
5  21  30  10  38

In [21]:
# Some Operations in DataFrames
print(df.shape)

(6, 4)

In [22]:
df.head(n=3) # Shows top 3 rows in the DataFrame.

    A   B   C   D
0  30  24  25  36
1   9  49  30  28
2  43  20  46  44

In [23]:
df.tail(n=2) # Shows last 2 rows in the DataFrame.

    A   B   C   D
4  36  31  10  27
5  21  30  10  38

In [28]:
# Extracting Multiple Columns
cols=['A','B']
df[cols]

    A   B
0  30  24
1   9  49
2  43  20
3  29  36
4  36  31
5  21  30

In [31]:
df[['B','D','A']]

    B   D   A
0  24  36  30
1  49  28   9
2  20  44  43
3  36  32  29
4  31  27  36
5  30  38  21

In [33]:
# Add new Columns to the df DataFrame and Some Operations on the column.
df['A+B']=df['A']+df['B']
df

    A   B   C   D  A+B
0  30  24  25  36   54
1   9  49  30  28   58
2  43  20  46  44   63
3  29  36  20  32   65
4  36  31  10  27   67
5  21  30  10  38   51

In [34]:
df['A-B']=df['A']-df['B']
df

    A   B   C   D  A+B  A-B
0  30  24  25  36   54    6
1   9  49  30  28   58  -40
2  43  20  46  44   63   23
3  29  36  20  32   65   -7
4  36  31  10  27   67    5
5  21  30  10  38   51   -9

In [37]:
# Drop 'A-B' Column.
df=df.drop(columns=['A-B'])
df

    A   B   C   D  A+B
0  30  24  25  36   54
1   9  49  30  28   58
2  43  20  46  44   63
3  29  36  20  32   65
4  36  31  10  27   67
5  21  30  10  38   51

# Indexing/Extracting Data[Rows]

In [39]:
df

    A   B   C   D  A+B
0  30  24  25  36   54
1   9  49  30  28   58
2  43  20  46  44   63
3  29  36  20  32   65
4  36  31  10  27   67
5  21  30  10  38   51

In [40]:
# Changing the Row Names.
df.index=['P','Q','R','S','T','U']

In [41]:
df

    A   B   C   D  A+B
P  30  24  25  36   54
Q   9  49  30  28   58
R  43  20  46  44   63
S  29  36  20  32   65
T  36  31  10  27   67
U  21  30  10  38   51

In [42]:
# loc --> Used to Extract a Particular Row in a DataFrame.
df.loc['P']

A      30
B      24
C      25
D      36
A+B    54
Name: P, dtype: int64

In [45]:
#iloc --> IntegerLocation [Extract the row by index not by RowName]
df.iloc[0]

A      30
B      24
C      25
D      36
A+B    54
Name: P, dtype: int64

In [47]:
# Extract Multiple Rows. [Pass the requred Rows as list to the iloc function].
df.iloc[[0,1,2]]

    A   B   C   D  A+B
P  30  24  25  36   54
Q   9  49  30  28   58
R  43  20  46  44   63

In [51]:
df.iloc[2:5][['A','B']] # Extract R,S,T indices and their values in 'A','B' columns.

    A   B
R  43  20
S  29  36
T  36  31

In [52]:
df

    A   B   C   D  A+B
P  30  24  25  36   54
Q   9  49  30  28   58
R  43  20  46  44   63
S  29  36  20  32   65
T  36  31  10  27   67
U  21  30  10  38   51

In [61]:
# Now if we wish to find the last four Elements in DF[27,67,38,51].
df.iloc[-2:][['D','A+B']]

    D  A+B
T  27   67
U  38   51

In [62]:
# Or we can use ',' to do this.
df.iloc[-2:,-2:]

    D  A+B
T  27   67
U  38   51